{
    "Type": 2,
    "Yearly Analysis": [
        {
            "Type": 1,
            "Company Details": {
                "Company Name": "CAMBRIDGE ENTERPRISE LIMITED",
                "UK Companies House Registered Number": "01069886",
                "Start date covered by report": "2017-08-01",
                "End date covered by report": "2018-07-31",
                "SIC": 70229,
                "Industry": "Management consultancy activities other than financial management",
                "Sector": "Professional, scientific and technical activities"
            },
            "Directors": {
                "Number of directors": 10,
                "Flag": 1,
                "Message": null
            },
            "Director Turnover": {
                "Turnover": 0,
                "Appointments": 0,
                "Flag": 1,
                "Message": null
            },
            "Gross Profit": {
                "Gross Profit": 3302847.0,
                "Gross Profit Margin": null,
                "Flag": 3,
                "Message": "Gross profit or turnover missing or inappropriately tagged."
            },
            "Net Profit": {
                "Net Profit": null,
                "Net Profit Margin": null,
                "Flag": 3,
                "Message": "Net profit or turnover missing or inappropriately tagged."
            },
            "Liquidity Ratio": {
                "Liquidity Ratio": 0.689111391692077,
                "Flag": 3,
                "Message": "Current liabilities outweigh assets"
            },
            "Debtor Days": {
                "Debtor Days": null,
                "Flag": 3,
                "Message": "Debtors within a year missing or inappropriately tagged."
            },
            "Auditors' Report": [
                "Independent auditors’ report to the members of Cambridge Enterprise Limited\n\n\nReport on the audit of the financial statements\n\n\nOpinion\n\n\nIn our opinion, Cambridge Enterprise Limited’s financial statements:\ngive a true and fair view of the state of the company’s affairs as at \n     31 July 2018\n and of its profit for the year then ended;\nhave been properly prepared in accordance with United Kingdom Generally Accepted Accounting Practice (United Kingdom Accounting Standards, comprising FRS 102 “The Financial Reporting Standard applicable in the UK and Republic of Ireland”, and applicable law); and\nhave been prepared in accordance with the requirements of the Companies Act 2006.\nWe have audited the financial statements, included within the Annual Report and Financial Statements (the “Annual Report”), which comprise: balance sheet as at \n     31 July 2018\n; the statement of comprehensive income, the statement of changes in equity for the year ended; and the notes to the financial statements, which include a description of the significant accounting policies.\n\n\nBasis for opinion\n\n\nWe conducted our audit in accordance with International Standards on Auditing (UK) (“ISAs (UK)”) and applicable law. Our responsibilities under ISAs (UK) are further described in the Auditors’ responsibilities for the audit of the financial statements section of our report. We believe that the audit evidence we have obtained is sufficient and appropriate to provide a basis for our opinion.\n\n\nIndependence\n\n\nWe remained independent of the company in accordance with the ethical requirements that are relevant to our audit of the financial statements in the UK, which includes the FRC’s Ethical Standard, and we have fulfilled our other ethical responsibilities in accordance with these requirements.\n\n\nConclusions relating to going concern\n\n\nWe have nothing to report in respect of the following matters in relation to which ISAs (UK) require us to report to you when:\nthe directors’ use of the going concern basis of accounting in the preparation of the financial statements is not appropriate; or\nthe directors have not disclosed in the financial statements any identified material uncertainties that may cast significant doubt about the company’s ability to continue to adopt the going concern basis of accounting for a period of at least twelve months from the date when the financial statements are authorised for issue.\nHowever, because not all future events or conditions can be predicted, this statement is not a guarantee as to the company’s ability to continue as a going concern.\n\n\nReporting on other information\n\n\nThe other information comprises all of the information in the Annual Report other than the financial statements and our auditors’ report thereon. The directors are responsible for the other information. Our opinion on the financial statements does not cover the other information and, accordingly, we do not express an audit opinion or, except to the extent otherwise explicitly stated in this report, any form of assurance thereon.\nIn connection with our audit of the financial statements, our responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or our knowledge obtained in the audit, or otherwise appears to be materially misstated. If we identify an apparent material inconsistency or material misstatement, we are required to perform procedures to conclude whether there is a material misstatement of the financial statements or a material misstatement of the other information. If, based on the work we have performed, we conclude that there is a material misstatement of this other information, we are required to report that fact. We have nothing to report based on these responsibilities.\nWith respect to the Strategic Report and Directors’ Report, we also considered whether the disclosures required by the UK Companies Act 2006 have been included. \nBased on the responsibilities described above and our work undertaken in the course of the audit, ISAs (UK) require us also to report certain opinions and matters as described below."
            ],
            "Negative Indices": {}
        },
        {
            "Type": 1,
            "Company Details": {
                "Company Name": "CAMBRIDGE ENTERPRISE LIMITED",
                "UK Companies House Registered Number": "01069886",
                "Start date covered by report": "2018-08-01",
                "End date covered by report": "2019-07-31",
                "SIC": 70229,
                "Industry": "Management consultancy activities other than financial management",
                "Sector": "Professional, scientific and technical activities"
            },
            "Directors": {
                "Number of directors": 13,
                "Flag": 1,
                "Message": null
            },
            "Director Turnover": {
                "Turnover": 4,
                "Appointments": 3,
                "Flag": 1,
                "Message": null
            },
            "Gross Profit": {
                "Gross Profit": 1277612.0,
                "Gross Profit Margin": null,
                "Flag": 3,
                "Message": "Gross profit or turnover missing or inappropriately tagged."
            },
            "Net Profit": {
                "Net Profit": null,
                "Net Profit Margin": null,
                "Flag": 3,
                "Message": "Net profit or turnover missing or inappropriately tagged."
            },
            "Liquidity Ratio": {
                "Liquidity Ratio": 0.14414419348647536,
                "Flag": 3,
                "Message": "Current liabilities outweigh assets"
            },
            "Debtor Days": {
                "Debtor Days": null,
                "Flag": 3,
                "Message": "Debtors within a year missing or inappropriately tagged."
            },
            "Auditors' Report": [
                "Independent auditors’ report to the members of Cambridge Enterprise Limited\n\n\nReport on the audit of the financial statements\n\n\nOpinion\n\n\nIn our opinion, Cambridge Enterprise Limited’s financial statements: give a true and fair view of the state of the company’s affairs as at 31 July 2019 and of its profit for the year then ended; have been properly prepared in accordance with United Kingdom Generally Accepted Accounting Practice (United Kingdom Accounting Standards, comprising FRS 102 “The Financial Reporting Standard applicable in the UK and Republic of Ireland”, and applicable law); and have been prepared in accordance with the requirements of the Companies Act 2006.\nWe have audited the financial statements, included within the Annual Report and Financial Statements (the “Annual Report”), which comprise: balance sheet as at \n     31 July 2019\n; the statement of comprehensive income, the statement of changes in equity for the year then ended; and the notes to the financial statements, which include a description of the significant accounting policies.\n\n\nBasis for opinion\n\n\nWe conducted our audit in accordance with International Standards on Auditing (UK) (“ISAs (UK)”) and applicable law. Our responsibilities under ISAs (UK) are further described in the Auditors’ responsibilities for the audit of the financial statements section of our report. We believe that the audit evidence we have obtained is sufficient and appropriate to provide a basis for our opinion.\n\n\nIndependence\n\n\nWe remained independent of the company in accordance with the ethical requirements that are relevant to our audit of the financial statements in the UK, which includes the FRC’s Ethical Standard, and we have fulfilled our other ethical responsibilities in accordance with these requirements.\n\n\nConclusions relating to going concern\n\n\nISAs (UK) require us to report to you when: the directors’ use of the going concern basis of accounting in the preparation of the financial statements is not appropriate; or the directors have not disclosed in the financial statements any identified material uncertainties that may cast significant doubt about the company’s ability to continue to adopt the going concern basis of accounting for a period of at least twelve months from the date when the financial statements are authorised for issue.\nWe have nothing to report in respect of the above matters.\nHowever, because not all future events or conditions can be predicted, this statement is not a guarantee as to the company’s ability to continue as a going concern. For example, the terms on which the United Kingdom may withdraw from the European Union are not clear, and it is difficult to evaluate all of the potential implications on the company’s trade, customers, suppliers and the wider economy.\n\n\nReporting on other information\n\n\nThe other information comprises all of the information in the Annual Report other than the financial statements and our auditors’ report thereon. The directors are responsible for the other information. Our opinion on the financial statements does not cover the other information and, accordingly, we do not express an audit opinion or, except to the extent otherwise explicitly stated in this report, any form of assurance thereon.\nIn connection with our audit of the financial statements, our responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or our knowledge obtained in the audit, or otherwise appears to be materially misstated. If we identify an apparent material inconsistency or material misstatement, we are required to perform procedures to conclude whether there is a material misstatement of the financial statements or a material misstatement of the other information. If, based on the work we have performed, we conclude that there is a material misstatement of this other information, we are required to report that fact. We have nothing to report based on these responsibilities.\nWith respect to the Strategic Report and Directors’ Report, we also considered whether the disclosures required by the UK Companies Act 2006 have been included.\nBased on the responsibilities described above and our work undertaken in the course of the audit, ISAs (UK) require us also to report certain opinions and matters as described below."
            ],
            "Negative Indices": {}
        },
        {
            "Type": 1,
            "Company Details": {
                "Company Name": "CAMBRIDGE ENTERPRISE LIMITED",
                "UK Companies House Registered Number": "01069886",
                "Start date covered by report": "2019-08-01",
                "End date covered by report": "2020-07-31",
                "SIC": 70229,
                "Industry": "Management consultancy activities other than financial management",
                "Sector": "Professional, scientific and technical activities"
            },
            "Directors": {
                "Number of directors": 14,
                "Flag": 1,
                "Message": null
            },
            "Director Turnover": {
                "Turnover": 4,
                "Appointments": 2,
                "Flag": 2,
                "Message": "Increased turnover including some resignations"
            },
            "Gross Profit": {
                "Gross Profit": 1263676.0,
                "Gross Profit Margin": null,
                "Flag": 3,
                "Message": "Gross profit or turnover missing or inappropriately tagged."
            },
            "Net Profit": {
                "Net Profit": null,
                "Net Profit Margin": null,
                "Flag": 3,
                "Message": "Net profit or turnover missing or inappropriately tagged."
            },
            "Liquidity Ratio": {
                "Liquidity Ratio": 0.8484367022051974,
                "Flag": 3,
                "Message": "Current liabilities outweigh assets"
            },
            "Debtor Days": {
                "Debtor Days": null,
                "Flag": 3,
                "Message": "Debtors within a year missing or inappropriately tagged."
            },
            "Auditors' Report": [
                "INDEPENDENT AUDITORS’ REPORT TO THE MEMBERS OF CAMBRIDGE ENTERPRISE LIMITED\n\n\nOpinion\n\n\nWe have audited the financial statements of Cambridge Enterprise Limited (the 'Company') for the year ended 31 July 2020, which comprise the Statement of Total Comprehensive Income, the Statement of Changes in Equity, the Balance Sheet, and the notes to the financial statements, including a summary of significant accounting policies. The financial reporting framework that has been applied in their preparation is applicable law and United Kingdom Accounting Standards, including Financial Reporting Standard 102 ‘The Financial Reporting Standard applicable in the UK and Republic of Ireland’ (United Kingdom Generally Accepted Accounting Practice).\nIn our opinion, the accompanying financial statements: give a true and fair view of the state of the Company’s affairs as at 31 July 2020 and of its profit for the year then ended; have been properly prepared in accordance with United Kingdom Generally Accepted Accounting Practice; and have been properly prepared in accordance with the requirements of the Companies Act 2006.\n\n\nBASIS FOR OPINION\n\n\nWe conducted our audit in accordance with International Standards on Auditing (UK) (ISAs (UK)) and applicable law. Our responsibilities under those standards are further described in the Auditors' responsibilities for the audit of the financial statements section of our report. We are independent of the Company in accordance with the ethical requirements that are relevant to our audit of financial statements in the United Kingdom, including the Financial Reporting Council’s Ethical Standard, and we have fulfilled our other ethical responsibilities in accordance with these requirements. We believe that the audit evidence we have obtained is sufficient and appropriate to provide a basis for our opinion.\n\n\nCONCLUSIONS RELATING TO GOING CONCERN\n\n\nWe have nothing to report in respect of the following matters in relation to which the ISAs (UK) require us to report to you where: the directors' use of the going concern basis of accounting in the preparation of the financial statements is not appropriate; or the directors have not disclosed in the financial statements any identified material uncertainties that may cast significant doubt about the Company's ability to continue to adopt the going concern basis of accounting for a period of at least twelve months from the date when the financial statements are authorised for issue.\n\n\nOTHER INFORMATION\n\n\nThe directors are responsible for the other information. The other information comprises the information included in the Annual report, other than the financial statements and our Auditors' report thereon. Our opinion on the financial statements does not cover the other information and, except to the extent otherwise explicitly stated in our report, we do not express any form of assurance conclusion thereon.\nIn connection with our audit of the financial statements, our responsibility is to read the other information and, in doing so, consider whether the other information is materially inconsistent with the financial statements or our knowledge obtained in the audit or otherwise appears to be materially misstated. If we identify such material inconsistencies or apparent material misstatements, we are required to determine whether there is a material misstatement in the financial statements or a material misstatement of the other information. If, based on the work we have performed, we conclude that there is a material misstatement of this other information, we are required to report that fact.\nWe have nothing to report in this regard."
            ],
            "Negative Indices": {}
        }
    ],
    "Comparisons": [
        {
            "Turnover": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Gross profit/loss": {
                "Company1": 3302847.0,
                "Company2": 1277612.0,
                "Absolute Change": -2025235.0,
                "Relative Change": -0.6131785698822864
            },
            "Net profit/loss": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Tangible fixed assets": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Investments fixed assets": {
                "Company1": 22044324.0,
                "Company2": 26584458.0,
                "Absolute Change": 4540134.0,
                "Relative Change": 0.205954784551343
            },
            "Fixed assets balance": {
                "Company1": 22044324.0,
                "Company2": 27111557.0,
                "Absolute Change": 5067233.0,
                "Relative Change": 0.22986565612082277
            },
            "Debtors (due within one year)": {
                "Company1": 5392620.0,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Cash balance": {
                "Company1": 2660512.0,
                "Company2": 9889177.0,
                "Absolute Change": 7228665.0,
                "Relative Change": 2.7170202577548985
            },
            "Current assets balance": {
                "Company1": 8053132.0,
                "Company2": 12963304.0,
                "Absolute Change": 4910172.0,
                "Relative Change": 0.6097220311302485
            },
            "Creditors (due within one year)": {
                "Company1": 5549505.0,
                "Company2": 1868585.0,
                "Absolute Change": -3680920.0,
                "Relative Change": -0.6632879869465835
            },
            "Current liabilities balance": {
                "Company1": 5549505.0,
                "Company2": 1868585.0,
                "Absolute Change": -3680920.0,
                "Relative Change": -0.6632879869465835
            },
            "Net assets/liabilities balance": {
                "Company1": 2503627.0,
                "Company2": 2418942.0,
                "Absolute Change": -84685.0,
                "Relative Change": -0.033824926796204066
            },
            "Gross profit margin": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Liquidity ratio": {
                "Company1": 1.451144201149472,
                "Company2": 6.93749762520838,
                "Absolute Change": 5.486353424058908,
                "Relative Change": 3.7807086433678263
            },
            "Debtor days": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Suspicious Changes": {
                "Gross profit/loss": -0.6131785698822864,
                "Investments fixed assets": 0.205954784551343,
                "Fixed assets balance": 0.22986565612082277,
                "Cash balance": 2.7170202577548985,
                "Current assets balance": 0.6097220311302485,
                "Creditors (due within one year)": -0.6632879869465835,
                "Current liabilities balance": -0.6632879869465835,
                "Liquidity ratio": 3.7807086433678263
            }
        },
        {
            "Turnover": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Gross profit/loss": {
                "Company1": 1277612.0,
                "Company2": 1263676.0,
                "Absolute Change": -13936.0,
                "Relative Change": -0.010907849957577105
            },
            "Net profit/loss": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Tangible fixed assets": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Investments fixed assets": {
                "Company1": 26584458.0,
                "Company2": 27182870.0,
                "Absolute Change": 598412.0,
                "Relative Change": 0.02250984390955046
            },
            "Fixed assets balance": {
                "Company1": 27111557.0,
                "Company2": 27182870.0,
                "Absolute Change": 71313.0,
                "Relative Change": 0.002630354280279808
            },
            "Debtors (due within one year)": {
                "Company1": null,
                "Company2": 3676588.0,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Cash balance": {
                "Company1": 9889177.0,
                "Company2": 2737577.0,
                "Absolute Change": -7151600.0,
                "Relative Change": -0.7231744360526665
            },
            "Current assets balance": {
                "Company1": 12963304.0,
                "Company2": 6414165.0,
                "Absolute Change": -6549139.0,
                "Relative Change": -0.5052060030374972
            },
            "Creditors (due within one year)": {
                "Company1": 1868585.0,
                "Company2": 5442013.0,
                "Absolute Change": 3573428.0,
                "Relative Change": 1.9123711257448819
            },
            "Current liabilities balance": {
                "Company1": 1868585.0,
                "Company2": 5442013.0,
                "Absolute Change": 3573428.0,
                "Relative Change": 1.9123711257448819
            },
            "Net assets/liabilities balance": {
                "Company1": 2418942.0,
                "Company2": 28155022.0,
                "Absolute Change": 25736080.0,
                "Relative Change": 10.639395239737041
            },
            "Gross profit margin": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Liquidity ratio": {
                "Company1": 6.93749762520838,
                "Company2": 1.1786383090227825,
                "Absolute Change": -5.758859316185597,
                "Relative Change": -0.8301061315336479
            },
            "Debtor days": {
                "Company1": null,
                "Company2": null,
                "Absolute Change": null,
                "Relative Change": null
            },
            "Suspicious Changes": {
                "Cash balance": -0.7231744360526665,
                "Current assets balance": -0.5052060030374972,
                "Creditors (due within one year)": 1.9123711257448819,
                "Current liabilities balance": 1.9123711257448819,
                "Net assets/liabilities balance": 10.639395239737041,
                "Liquidity ratio": -0.8301061315336479
            }
        }
    ],
    "Missing Reports": []
}